wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/StdDriver/src/rtc.c
/**************************************************************************//**
 * @file     rtc.c
 * @version  V1.00
 * @brief    M2003J series Real Time Clock(RTC) driver source file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (c) 2017-2026 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include "NuMicro.h"


/** @cond HIDDEN_SYMBOLS */

/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define RTC_GLOBALS

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static volatile uint32_t g_u32hiYear;
static volatile uint32_t g_u32loYear;
static volatile uint32_t g_u32hiMonth;
static volatile uint32_t g_u32loMonth;
static volatile uint32_t g_u32hiDay;
static volatile uint32_t g_u32loDay;
static volatile uint32_t g_u32hiHour;
static volatile uint32_t g_u32loHour;
static volatile uint32_t g_u32hiMin;
static volatile uint32_t g_u32loMin;
static volatile uint32_t g_u32hiSec;
static volatile uint32_t g_u32loSec;

/** @endcond HIDDEN_SYMBOLS */


/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup RTC_Driver RTC Driver
  @{
*/

/** @addtogroup RTC_EXPORTED_FUNCTIONS RTC Exported Functions
  @{
*/

/**
  * @brief      Initialize RTC module and start counting
  *
  * @param[in]  sPt     Specify the time property and current date and time. It includes:           \n
  *                     u32Year: Year value, range between 2000 ~ 2099.                             \n
  *                     u32Month: Month value, range between 1 ~ 12.                                \n
  *                     u32Day: Day value, range between 1 ~ 31.                                    \n
  *                     u32DayOfWeek: Day of the week. [RTC_SUNDAY / RTC_MONDAY / RTC_TUESDAY /
  *                                                     RTC_WEDNESDAY / RTC_THURSDAY / RTC_FRIDAY /
  *                                                     RTC_SATURDAY]                               \n
  *                     u32Hour: Hour value, range between 0 ~ 23.                                  \n
  *                     u32Minute: Minute value, range between 0 ~ 59.                              \n
  *                     u32Second: Second value, range between 0 ~ 59.                              \n
  *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                                 \n
  *                     u8AmPm: [RTC_AM / RTC_PM]                                                   \n
  *
  * @retval  0: SUCCESS
  * @retval -1: Initialize RTC module fail
  *
  * @details    This function is used to: \n
  *                 1. Write initial key to let RTC start count.  \n
  *                 2. Input parameter indicates start date/time. \n
  *                 3. User has to make sure that parameters of RTC date/time are reasonable. \n
  * @note       Null pointer for using default starting date/time.
  */
int32_t RTC_Open(S_RTC_TIME_DATA_T *psPt)
{
    uint32_t u32TimeOutCount = SystemCoreClock; /* 1 second time-out */

    RTC->INIT = RTC_INIT_KEY;

    if(RTC->INIT != RTC_INIT_ACTIVE_Msk)
    {
        RTC->INIT = RTC_INIT_KEY;
        while(RTC->INIT != RTC_INIT_ACTIVE_Msk)
        {
            if(--u32TimeOutCount == 0)
            {
                return -1;
            }
        }
    }

    if(psPt != (void *)0)
    {
        /* Enable frequency dynamic compensation function */
        RTC->CLKFMT |= RTC_CLKFMT_DCOMPEN_Msk;

        /* Set RTC date and time */
        RTC_SetDateAndTime(psPt);
    }

    return 0;
}

/**
  * @brief      Disable RTC Clock
  *
  * @param      None
  *
  * @return     None
  *
  * @details    This API will disable RTC peripheral clock and stops RTC counting.
  */
void RTC_Close(void)
{
    CLK->RTCCTL &= ~CLK_RTCCTL_RTC0CKEN_Msk;
}

/**
 *  @brief    Set Frequency Compensation Data
  *
 *  @param[in]    i32FrequencyX10000    Specify the RTC clock X 10000, ex: 327736512 means 32773.6512.
  *
  * @return     None
  *
  */
void RTC_32KCalibration(int32_t i32FrequencyX10000)
{

    /*
              Frequency counter measurement : 32773.6512 Hz
    */
    int32_t i32Compensate;

    /* 327736512 %10000 = 6512  */
    i32Compensate = i32FrequencyX10000 % 10000;
    /*Fraction Part: (6512 X 64)/10000 = 41.6768(0x2A) => RTC_FREQADJ[5:0]=0x2A*/
    i32Compensate = ((i32Compensate * 64) / 10000);
    i32Compensate &= 0x3F;
    /*
         Formula for 32K compensation is
           FREQADJ = 0~0x00001F00 (Frequency range : 32752Hz ~ 32783Hz)
    */

    if (i32FrequencyX10000 >= (int32_t)327840000)
    {
        i32Compensate = 0x1F3F;
    }
    else if (i32FrequencyX10000 < (int32_t)327520000)
    {
        i32Compensate = 0x0;
    }
    else
    {
        int32_t i32Index;
        /*  Integer Part: 32773 => RTC_FREQADJ[12:8] = 0x15 */
        for (i32Index = 0L; i32Index < 0x20L ; i32Index++)
        {
            if ((i32FrequencyX10000 >= (327520000 + (i32Index * 10000))) && (i32FrequencyX10000 < (327520000 + ((i32Index + 1) * 10000))))
            {
                i32Compensate += (int32_t)((uint32_t)i32Index << RTC_FREQADJ_INTEGER_Pos);
                break;
            }
        }
    }


    RTC->FREQADJ = (uint32_t)i32Compensate;
}

/**
  * @brief      Get Current RTC Date and Time
  *
  * @param[out] sPt     The returned pointer is specified the current RTC value. It includes: \n
  *                     u32Year: Year value                                                   \n
  *                     u32Month: Month value                                                 \n
  *                     u32Day: Day value                                                     \n
  *                     u32DayOfWeek: Day of week                                             \n
  *                     u32Hour: Hour value                                                   \n
  *                     u32Minute: Minute value                                               \n
  *                     u32Second: Second value                                               \n
  *                     u32TimeScale: [RTC_CLOCK_12 / RTC_CLOCK_24]                           \n
  *                     u8AmPm: [RTC_AM / RTC_PM]                                             \n
  *
  * @return     None
  *
  * @details    This API is used to get the current RTC date and time value.
  */
void RTC_GetDateAndTime(S_RTC_TIME_DATA_T *psPt)
{
    uint32_t u32Tmp;

    psPt->u32TimeScale = RTC->CLKFMT & RTC_CLKFMT_24HEN_Msk;     /* 12/24-hour */
    psPt->u32DayOfWeek = RTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk; /* Day of the week */

    /* Get [Date digit] data */
    g_u32hiYear  = (RTC->CAL & RTC_CAL_TENYEAR_Msk) >> RTC_CAL_TENYEAR_Pos;
    g_u32loYear  = (RTC->CAL & RTC_CAL_YEAR_Msk) >> RTC_CAL_YEAR_Pos;
    g_u32hiMonth = (RTC->CAL & RTC_CAL_TENMON_Msk) >> RTC_CAL_TENMON_Pos;
    g_u32loMonth = (RTC->CAL & RTC_CAL_MON_Msk) >> RTC_CAL_MON_Pos;
    g_u32hiDay   = (RTC->CAL & RTC_CAL_TENDAY_Msk) >> RTC_CAL_TENDAY_Pos;
    g_u32loDay   = (RTC->CAL & RTC_CAL_DAY_Msk) >> RTC_CAL_DAY_Pos;

